hydevcode/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_WIFI/packages/wifi-host-driver-latest/wifi-connection-manager/source/COMPONENT_WPS/cy_wps_common.c
                // Send ACK
                cy_wps_send_basic_packet(workspace, WPS_ID_MESSAGE_ACK, 0);
                cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Sending ACK\r\n");

                // Wait for more M2D, but if we time out we should join to another AP
                cy_host_start_timer( workspace->wps_host_workspace, 1000 );
                goto return_with_packet_and_maybe_fragment;
            }
            /* Check if we're an enrollee and this message is valid for the previous state since some P2P registrars time out early and resend M2 */
            else if ( ( workspace->agent_type == CY_WPS_ENROLLEE_AGENT ) &&
                      (message_type == wps_states[workspace->agent_type][workspace->current_sub_stage - 1].valid_message_type ) )
            {
                result = CY_RSLT_SUCCESS;
                goto return_with_packet_and_maybe_fragment;
            }
            else
            {
                result = CY_RSLT_WPS_ERROR_INCORRECT_MESSAGE;
                goto return_with_packet_and_maybe_fragment;
            }

            if ( workspace->agent_type == CY_WPS_REGISTRAR_AGENT )
            {
                ++workspace->last_received_id;
            }

            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Free unfragmented pkt @ BESL_EVENT_EAPOL_PACKET_RECEIVED\r\n");
            cy_wps_free_unfragmented_packet( workspace );
            whd_buffer_release(workspace->interface->whd_driver, message->data.packet, WHD_NETWORK_RX);
            break;

        case CY_WPS_EVENT_RECEIVED_WPS_START:
            workspace->current_sub_stage = CY_WPS_SENDING_PUBLIC_KEYS;
            break;

        case CY_EVENT_TIMER_TIMEOUT:
            return CY_RSLT_WPS_ERROR_NO_RESPONSE;
            break;

        case CY_WPS_EVENT_PBC_OVERLAP_NOTIFY_USER:
            cy_wps_pbc_overlap_array_notify( message->data.packet );
            return CY_RSLT_SUCCESS;
            break;

        case CY_EVENT_NO_EVENT:
        case CY_EVENT_ABORT_REQUESTED:
        case CY_EVENT_RECEIVED_IDENTITY_REQUEST:
        case CY_EVENT_COMPLETE:
        case CY_WPS_EVENT_DISCOVER_COMPLETE:
        case CY_WPS_EVENT_ENROLLEE_ASSOCIATED:
        case CY_WPS_EVENT_RECEIVED_IDENTITY:
        case CY_WPS_EVENT_RECEIVED_EAPOL_START:
        default:
            return CY_RSLT_WPS_UNKNOWN_EVENT;
            break;
    }

    if (workspace->current_main_stage == CY_WPS_IN_WPS_HANDSHAKE)
    {
        /* Send the packet for the current state */
        whd_host_buffer_get( workspace->interface->whd_driver, &outgoing_packet, WHD_NETWORK_TX, 1024 + WHD_LINK_HEADER, true );
        whd_buffer_add_remove_at_front( workspace->interface->whd_driver, &outgoing_packet, WHD_LINK_HEADER );
        packet_header = (cy_wps_msg_packet_t*) whd_buffer_get_current_piece_data_pointer( workspace->interface->whd_driver, outgoing_packet );
        memset(packet_header, 0, whd_buffer_get_current_piece_size( workspace->interface->whd_driver, outgoing_packet));
        iter = packet_header->data;
        iter = cy_wps_write_common_header( workspace, iter, wps_states[workspace->agent_type][workspace->current_sub_stage].outgoing_message_type );
        iter = wps_states[workspace->agent_type][workspace->current_sub_stage].packet_generator( workspace, iter );
        cy_wps_send_protocol_message( workspace, outgoing_packet, (uint8_t*) &packet_header->data, iter );
    }

    return CY_RSLT_SUCCESS;

return_with_packet_and_maybe_fragment:
cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Free unfragmented pkt\r\n");
    cy_wps_free_unfragmented_packet( workspace );

return_with_packet:
cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Free host pkt\r\n");
    whd_buffer_release( workspace->interface->whd_driver, message->data.packet, WHD_NETWORK_RX );
    return result;
}

static uint8_t* cy_wps_write_common_header(cy_wps_agent_t* workspace, uint8_t* start_of_packet, uint8_t message_type)
{
    uint8_t version           = WPS_VERSION;
    uint8_t temp_message_type = message_type;

    // Write the version and message type
    uint8_t* iter = start_of_packet;
    iter = tlv_write_value( iter, WPS_ID_VERSION,  WPS_ID_VERSION_S,  &version,           TLV_UINT8 );
    iter = tlv_write_value( iter, WPS_ID_MSG_TYPE, WPS_ID_MSG_TYPE_S, &temp_message_type, TLV_UINT8 );

    // Write their nonce (if we have it)
    // Since we always have our nonce and this is common code for both Registrar and Enrollee we will check both bits and ignore our agent_type
    if ( ( message_type != WPS_ID_MESSAGE_M2 ) && ( workspace->available_crypto_material & (CY_WPS_CRYPTO_MATERIAL_REGISTRAR_NONCE | CY_WPS_CRYPTO_MATERIAL_ENROLLEE_NONCE)) == (CY_WPS_CRYPTO_MATERIAL_REGISTRAR_NONCE | CY_WPS_CRYPTO_MATERIAL_ENROLLEE_NONCE) )
    {
        iter = tlv_write_value( iter, agent_specific_tlv_id[OPPOSITE_AGENT_TYPE(workspace->agent_type)][CY_WPS_NONCE_INDEX], SIZE_128_BITS, &workspace->their_data.nonce, TLV_UINT8_PTR );
    }
    return iter;
}

static void cy_wps_send_protocol_message(cy_wps_agent_t* workspace, cy_packet_t* packet, uint8_t* start_of_packet, uint8_t* iter)
{
    cy_wps_hash_t hmac_output;
    uint16_t eap_length;
    cy_wps_msg_packet_t* packet_header;
    uint16_t aligned_length;
    uint32_t aligned_vendor_type;

    // Check if we have auth key
    if ( ( workspace->available_crypto_material & CY_WPS_CRYPTO_MATERIAL_AUTH_KEY ) != 0 )
    {
        /* Calculate and add HMAC. The HMAC should have been started with the processing of the previous message */
        cy_sha2_hmac_update( &workspace->hmac, start_of_packet, (uint32_t)( iter - start_of_packet ) );
        cy_sha2_hmac_finish( &workspace->hmac, (unsigned char*) &hmac_output );
        iter = tlv_write_value( iter, WPS_ID_AUTHENTICATOR, SIZE_64_BITS, &hmac_output, TLV_UINT8_PTR );

        /* Start calculating the authenticator for the next message */
        cy_sha2_hmac_starts( &workspace->hmac, (unsigned char*) &workspace->auth_key, SIZE_256_BITS, WPS_HASH_ALGO );
        cy_sha2_hmac_update( &workspace->hmac, start_of_packet, (uint32_t)( iter - start_of_packet ) );
    }
    else
    {
        /* We should only get here when the agent is an enrollee and is sending M1
         * Create a copy of the message so it can be used to verify the M2 HMAC when we receive their nonce and public key */
        if ( workspace->m1_copy != NULL )
        {
            cy_wps_free( workspace->m1_copy );
        }
        workspace->m1_copy_length = (uint16_t)( iter - start_of_packet );
        workspace->m1_copy = (uint8_t*) cy_wps_malloc( "wps m1 copy", workspace->m1_copy_length );
        memcpy( workspace->m1_copy, start_of_packet, workspace->m1_copy_length );
    }

    eap_length = (uint16_t)( (uint16_t)( iter - start_of_packet ) + sizeof(cy_eap_header_t) + sizeof(cy_eap_expanded_header_t) );

