hydevcode/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_WIFI/packages/wifi-host-driver-latest/wifi-connection-manager/source/COMPONENT_WPS/cy_wps_common.c
    /* Fill EAP header */
    packet_header                       = (cy_wps_msg_packet_t*)whd_buffer_get_current_piece_data_pointer( workspace->interface->whd_driver, packet );
    packet_header->eap.code             = (workspace->agent_type == CY_WPS_REGISTRAR_AGENT || workspace->in_reverse_registrar_mode == 1) ? CY_EAP_CODE_REQUEST : CY_EAP_CODE_RESPONSE;
    packet_header->eap.id               = workspace->last_received_id;
    CY_WPS_HOST_WRITE_16_BE(&aligned_length, eap_length);
    packet_header->eap.length = aligned_length;
    packet_header->eap.type             = CY_EAP_TYPE_WPS;
    packet_header->eap_expanded.flags   = 0;
    packet_header->eap_expanded.op_code = 4; /* WSC message */
    memcpy( packet_header->eap_expanded.vendor_id, WFA_VENDOR_EXT_ID, 3 );
    CY_WPS_HOST_WRITE_32_BE(&aligned_vendor_type, 1);
    packet_header->eap_expanded.vendor_type = aligned_vendor_type;

    /* Send EAPOL frame */
    if ( ( workspace->current_main_stage != CY_WPS_CLOSING_EAP ) && ( workspace->agent_type == CY_WPS_ENROLLEE_AGENT ) )
    {
        /* After the enrollee sends m1 wait a little longer in case the registrar is slow */
        if ( workspace->current_sub_stage == CY_WPS_SENDING_PUBLIC_KEYS )
        {
            cy_host_start_timer( workspace->wps_host_workspace, wps_m2_timeout );
        }
        else
        {
            cy_host_start_timer( workspace->wps_host_workspace, WPS_EAPOL_PACKET_TIMEOUT );
        }
    }
    cy_wps_send_eapol_packet( packet, workspace, CY_EAP_PACKET, &workspace->their_data.mac_address, eap_length );
}

static cy_rslt_t cy_wps_calculate_kdk(cy_wps_agent_t* workspace)
{
    cy_kdk_input_t                     kdk_input;
    cy_wps_session_key_derivation_output_t kdf_output;
    cy_wps_hash_t                      kdk;
    uint8_t                            diffie_hellman_key[SIZE_256_BITS];
    cy_wps_NN_t                        wps_prime;
    cy_wps_NN_t                        nn_workspace;
    cy_wps_NN_t                        shared_secret;
    cy_wps_NN_t                        their_public_key;

    /* Generate the Diffie-Hellman shared secret */
    wps_NN_set( &wps_prime, DH_P_VALUE );
    wps_NN_set( &their_public_key, workspace->their_data.public_key.key );

    nn_workspace.len  = 48;
    shared_secret.len = 48;
    NN_ExpModMont( (NN_t*) &shared_secret, (NN_t*) &their_public_key, (NN_t*) &workspace->my_private_key, (NN_t*) &wps_prime, (NN_t*) &nn_workspace );

    /* Compute the Diffie-Hellman key based on the shared secret */
    wps_NN_get( &shared_secret, (uint8_t*) nn_workspace.num );
    cy_sha256( (uint8_t*) nn_workspace.num, 192, (unsigned char*) diffie_hellman_key, WPS_HASH_ALGO );

    /* Generate the KDK */
    memcpy( &kdk_input.enrollee_nonce,  &workspace->enrollee_data->nonce,       sizeof(cy_wps_nonce_t) );
    memcpy( &kdk_input.enrollee_mac,    &workspace->enrollee_data->mac_address, sizeof(whd_mac_t) );
    memcpy( &kdk_input.registrar_nonce, &workspace->registrar_data->nonce,      sizeof(cy_wps_nonce_t) );

    cy_sha2_hmac( diffie_hellman_key, SIZE_256_BITS, (uint8_t*) &kdk_input, sizeof(cy_kdk_input_t), (uint8_t*) &kdk, WPS_HASH_ALGO );

    /* Generate auth_key, key_wrap_key and emsk */
    cy_wps_calculate_kdf( (uint8_t*) &kdk, sizeof(kdk), KDK_PERSONALIZATION_STRING, (uint8_t*) &kdf_output, sizeof(cy_wps_session_keys_t) );
    memcpy( &workspace->auth_key,     &kdf_output.keys.auth_key,     sizeof(cy_auth_key_t) );
    memcpy( &workspace->key_wrap_key, &kdf_output.keys.key_wrap_key, sizeof(cy_key_wrap_key_t) );
    memcpy( &workspace->emsk,         &kdf_output.keys.emsk,         SIZE_256_BITS );

    workspace->available_crypto_material |= CY_WPS_CRYPTO_MATERIAL_AUTH_KEY | CY_WPS_CRYPTO_MATERIAL_KEY_WRAP_KEY;

    return CY_RSLT_SUCCESS;
}

void cy_wps_init_workspace(cy_wps_agent_t* workspace)
{
    /* Get my MAC address */
    whd_wifi_get_mac_address(workspace->interface, &workspace->my_data.mac_address);

    memcpy(&workspace->uuid, WPS_TEMPLATE_UUID, sizeof(WPS_TEMPLATE_UUID));
    memcpy(&workspace->uuid.octet[sizeof(cy_wps_uuid_t) - sizeof(whd_mac_t)], &workspace->my_data.mac_address, sizeof(whd_mac_t));

    workspace->primary_device.category      = cy_hton16(workspace->device_details->device_category);
    workspace->primary_device.oui           = cy_hton32(WIFI_ALLIANCE_OUI);
    workspace->primary_device.sub_category  = cy_hton16(workspace->device_details->sub_category);
    workspace->rfBand                       = WPS_RFBAND_24GHZ;
    workspace->my_data.authTypeFlags        = workspace->device_details->authentication_type_flags;
    workspace->my_data.encrTypeFlags        = workspace->device_details->encryption_type_flags;
    workspace->connTypeFlags                = 0x01;
    workspace->scState                      = 0x01;
    workspace->my_data.supported_version    = WPS_VERSION2;
    workspace->their_data.supported_version = 0;
    workspace->osVersion                    = 1;
    workspace->fragmented_packet            = NULL;
    workspace->fragmented_packet_length     = 0;
    workspace->processing_fragmented_packet = FALSE;
    workspace->m1_copy                      = NULL;
    workspace->m1_copy_length               = 0;

    if ( workspace->agent_type == CY_WPS_ENROLLEE_AGENT )
    {
        cy_wps_enrollee_init( workspace );
    }
}

void cy_wps_reset_workspace( cy_wps_agent_t* workspace, whd_interface_t interface )
{
    cy_wps_cleanup_workspace( workspace );

    memset( &workspace->their_data, 0, sizeof(cy_wps_agent_data_t) );
    memset( &workspace->hmac, 0, sizeof( workspace->hmac ) );
    memset( &workspace->auth_key,     0, sizeof( workspace->auth_key ) );
    memset( &workspace->key_wrap_key, 0, sizeof( workspace->key_wrap_key ) );
    memset( &workspace->emsk,         0, sizeof( workspace->emsk ) );

    workspace->last_received_id          = 0;
    workspace->available_crypto_material = 0;
    workspace->in_reverse_registrar_mode = 0;

    if ( workspace->agent_type == CY_WPS_ENROLLEE_AGENT )
    {
        cy_wps_enrollee_reset( workspace, interface );
    }


    cy_wps_prepare_workspace_crypto( workspace );
}

void cy_wps_prepare_workspace_crypto( cy_wps_agent_t* workspace )
{
    cy_wps_NN_t wps_generator;
    cy_wps_NN_t wps_prime;
    cy_wps_NN_t calculation_workspace;
    cy_wps_NN_t public_key;
    size_t      output_length = 0;

    /* Public nonce generation */
    cy_host_random_bytes( (uint8_t*) &workspace->my_data.nonce, SIZE_128_BITS, &output_length );

    /* Public-Private key generation */
    workspace->my_private_key.len = PRIVATE_KEY_NN_LENGTH;
    cy_host_random_bytes( (uint8_t*) workspace->my_private_key.num, PRIVATE_KEY_BYTE_LENGTH, &output_length );

    // Create public key
    wps_generator.len = 48;
    memset( wps_generator.num, 0, 192 );
    wps_generator.num[47] = DH_G_VALUE;

    wps_NN_set( &wps_prime, DH_P_VALUE );

    calculation_workspace.len = 48;

    public_key.len = 48;
    NN_ExpModMont( (NN_t*) &public_key, (NN_t*) &wps_generator, (NN_t*) &workspace->my_private_key, (NN_t*) &wps_prime, (NN_t*) &calculation_workspace );
    wps_NN_get( &public_key, workspace->my_data.public_key.key );

