hydevcode/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_WIFI/packages/wifi-host-driver-latest/wifi-connection-manager/source/COMPONENT_WPS/cy_wps_common.c
    /* Secret nonce generation */
    cy_host_random_bytes( (uint8_t*) workspace->my_data.secret_nonce[0].nonce, SIZE_128_BITS, &output_length );
    cy_host_random_bytes( (uint8_t*) workspace->my_data.secret_nonce[1].nonce, SIZE_128_BITS, &output_length );
}

static cy_rslt_t cy_wps_calculate_hash(cy_wps_agent_t* workspace, cy_wps_agent_data_t* source, cy_wps_hash_t* output, uint8_t hash)
{
    cy_wps_hash_input_t hash_input;

    wps_assert("Bad args", (hash == 0) || (hash == 1));

    memcpy( &hash_input.secret,               &source->secret_nonce[hash],            sizeof(cy_wps_nonce_t) );
    memcpy( &hash_input.psk,                  &workspace->psk[hash],                  sizeof(cy_wps_psk_t) );
    memcpy( &hash_input.enrollee_public_key,  &workspace->enrollee_data->public_key,  sizeof(cy_public_key_t) );
    memcpy( &hash_input.registrar_public_key, &workspace->registrar_data->public_key, sizeof(cy_public_key_t) );

    cy_sha2_hmac( (unsigned char *)&workspace->auth_key, SIZE_256_BITS, (uint8_t*) &hash_input, sizeof( hash_input ), output->octet, WPS_HASH_ALGO );

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t cy_wps_calculate_psk(cy_wps_agent_t* workspace)
{
    cy_wps_hash_t hmac_output;
    uint16_t   password_length = (uint16_t) strlen( workspace->password );

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "WPS password %s\r\n", workspace->password);

    /* Hash 1st half of password and copy first 128 bits into psk1. If it is an odd length, the extra byte goes along with the first half */
    cy_sha2_hmac( (unsigned char *)&workspace->auth_key, SIZE_256_BITS, (uint8_t*) workspace->password, (uint32_t) ( ( password_length / 2 ) + ( password_length % 2 ) ), (uint8_t*) &hmac_output, WPS_HASH_ALGO );

    memcpy( &workspace->psk[0], &hmac_output, SIZE_128_BITS );

    /* Hash 2nd half of password and copy fist 128 bits into psk2 */
    cy_sha2_hmac( (unsigned char *)&workspace->auth_key, SIZE_256_BITS, (uint8_t*) ( workspace->password + ( password_length / 2 ) + ( password_length % 2 ) ), password_length / 2, (uint8_t*) &hmac_output, WPS_HASH_ALGO );

    memcpy( &workspace->psk[1], &hmac_output, SIZE_128_BITS );

    return CY_RSLT_SUCCESS;
}

static cy_rslt_t cy_wps_process_message_content( cy_wps_agent_t* workspace, uint8_t* content, uint16_t content_length, uint32_t tlv_mask )
{
    cy_wps_hash_t         hmac_output;
    tlv16_data_t*         tlv;
    uint16_t              encrypted_data_length = 0;
    cy_rslt_t             result = CY_RSLT_SUCCESS;
    uint32_t              parsed_tlvs    = 0;
    uint32_t              valid_tlv_mask = wps_states[workspace->agent_type][workspace->current_sub_stage].tlv_mask;
    cy_wps_encryption_data_t* encrypted_data = NULL;
    uint8_t*              authenticator  = NULL;

    /* Note that the P2P registrar can't do the overlap check for p2p clients because they can change their MAC address between sending the probe request and sending M1 */
    if ( ( workspace->agent_type == CY_WPS_REGISTRAR_AGENT) && ( workspace->wps_mode == CY_WPS_PBC_MODE ) && ( workspace->is_p2p_registrar == 0 ) &&
         ( cy_wps_pbc_overlap_check( &workspace->their_data.mac_address ) == CY_RSLT_WPS_PBC_OVERLAP ) )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "PBC overlap during message processing\r\n");
        workspace->wps_result = CY_RSLT_WPS_PBC_OVERLAP;
        return CY_RSLT_WPS_PBC_OVERLAP;
    }

    /* Process TLVs contained in message */
    for ( tlv = (tlv16_data_t*) content; ( (uint8_t*) tlv - content ) < content_length; tlv = (tlv16_data_t*) ( (uint8_t*) tlv + sizeof(tlv16_header_t) + cy_hton16(tlv->length) ) )
    {
#if 1
        tlv16_header_t temp_tlv;
        tlv16_header_t* aligned_tlv = &temp_tlv;
        memcpy(aligned_tlv, tlv, sizeof(tlv16_header_t));
#else
#define aligned_tlv     tlv
#endif
        switch ( cy_hton16(aligned_tlv->type) )
        {
            case WPS_ID_VERSION:
                parsed_tlvs |= CY_WPS_TLV_VERSION;
                if ( ( tlv->data[0] & 0xF0 ) != WPS_VERSION )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "WPS version mismatch\r\n");
                    return CY_RSLT_WPS_ERROR_VERSION_MISMATCH;
                }
                break;

            case WPS_ID_ENROLLEE_NONCE:
                parsed_tlvs |= CY_WPS_TLV_ENROLLEE_NONCE;
                workspace->available_crypto_material |= CY_WPS_CRYPTO_MATERIAL_ENROLLEE_NONCE;
                if ( (valid_tlv_mask & CY_WPS_TLV_ENROLLEE_NONCE) != 0 )
                {
                    if ( workspace->agent_type == CY_WPS_ENROLLEE_AGENT )
                    {
                        if ( memcmp( &workspace->enrollee_data->nonce, tlv->data, sizeof(cy_wps_nonce_t) ) != 0 )
                        {
                            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "WPS enrollee nonce mismatch\r\n");
                            return CY_RSLT_WPS_ERROR_ENROLLEE_NONCE_MISMATCH;
                        }
                    }
                    else if ( workspace->agent_type == CY_WPS_REGISTRAR_AGENT )
                    {
                        memcpy( &workspace->enrollee_data->nonce, tlv->data, sizeof(cy_wps_nonce_t) );
                    }
                }
                break;

            case WPS_ID_REGISTRAR_NONCE:
                parsed_tlvs |= CY_WPS_TLV_REGISTRAR_NONCE;
                workspace->available_crypto_material |= CY_WPS_CRYPTO_MATERIAL_REGISTRAR_NONCE;
                if (( valid_tlv_mask & CY_WPS_TLV_REGISTRAR_NONCE ) != 0 )
                {
                    if ( workspace->agent_type == CY_WPS_REGISTRAR_AGENT )
                    {
                        if ( memcmp( &workspace->registrar_data->nonce, tlv->data, sizeof(cy_wps_nonce_t) ) != 0 )
                        {
                            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "WPS registrar nonce mismatch\r\n");
                            return CY_RSLT_WPS_ERROR_REGISTRAR_NONCE_MISMATCH;
                        }
                    }
                    else if ( workspace->agent_type == CY_WPS_ENROLLEE_AGENT )
                    {
                        memcpy( &workspace->registrar_data->nonce, tlv->data, sizeof(cy_wps_nonce_t) );
                    }
                }
                break;

