hydevcode/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_WIFI/packages/wifi-host-driver-latest/wifi-connection-manager/source/COMPONENT_WPS/cy_wps_common.c
            case WPS_ID_E_HASH1:
                parsed_tlvs |= CY_WPS_TLV_E_HASH1;
                workspace->available_crypto_material |= CY_WPS_CRYPTO_MATERIAL_ENROLLEE_HASH1;
                if (( valid_tlv_mask & CY_WPS_TLV_E_HASH1 ) != 0 )
                {
                    memcpy( &workspace->enrollee_data->secret_hash[0], tlv->data, sizeof(cy_wps_hash_t) );
                }
                break;

            case WPS_ID_E_HASH2:
                parsed_tlvs |= CY_WPS_TLV_E_HASH2;
                workspace->available_crypto_material |= CY_WPS_CRYPTO_MATERIAL_ENROLLEE_HASH2;
                if ( (valid_tlv_mask & CY_WPS_TLV_E_HASH2) != 0 )
                {
                    memcpy( &workspace->enrollee_data->secret_hash[1], tlv->data, sizeof(cy_wps_hash_t) );
                }
                break;

            case WPS_ID_R_HASH1:
                parsed_tlvs |= CY_WPS_TLV_R_HASH1;
                workspace->available_crypto_material |= CY_WPS_CRYPTO_MATERIAL_REGISTRAR_HASH1;
                if ( (valid_tlv_mask & CY_WPS_TLV_R_HASH1) != 0 )
                {
                    memcpy( &workspace->registrar_data->secret_hash[0], tlv->data, sizeof(cy_wps_hash_t) );
                }
                break;

            case WPS_ID_R_HASH2:
                parsed_tlvs |= CY_WPS_TLV_R_HASH2;
                workspace->available_crypto_material |= CY_WPS_CRYPTO_MATERIAL_REGISTRAR_HASH2;
                if ( (valid_tlv_mask & CY_WPS_TLV_R_HASH2 )!= 0 )
                {
                    memcpy( &workspace->registrar_data->secret_hash[1], tlv->data, sizeof(cy_wps_hash_t) );
                }
                break;

            case WPS_ID_ENCR_SETTINGS:
                parsed_tlvs |= CY_WPS_TLV_ENCRYPTION_SETTINGS;
                if ( cy_hton16(aligned_tlv->length) >= sizeof(cy_wps_iv_t) + WPS_ENCRYPTION_BLOCK_SIZE )
                {
                    encrypted_data        = (cy_wps_encryption_data_t*) tlv->data;
                    encrypted_data_length = (uint16_t) ( cy_hton16(aligned_tlv->length) - sizeof(cy_wps_iv_t) );
                }
                break;

            case WPS_ID_AUTHENTICATOR:
                parsed_tlvs |= CY_WPS_TLV_AUTHENTICATOR;
                authenticator = tlv->data;
                break;

            case WPS_ID_AUTH_TYPE_FLAGS:
                parsed_tlvs |= CY_WPS_TLV_AUTH_TYPE_FLAGS;
                workspace->their_data.authTypeFlags = CY_WPS_HOST_READ_16_BE(tlv->data);
                if ( ( workspace->their_data.authTypeFlags & workspace->my_data.authTypeFlags ) == 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "WPS authentication type not supported\r\n");
                    return CY_RSLT_WPS_ERROR_AUTHENTICATION_TYPE_ERROR;
                }
                break;

            case WPS_ID_ENCR_TYPE_FLAGS:
                parsed_tlvs |= CY_WPS_TLV_ENCR_TYPE_FLAGS;
                workspace->their_data.encrTypeFlags = CY_WPS_HOST_READ_16_BE(tlv->data);
                if ( ( workspace->their_data.encrTypeFlags & workspace->my_data.encrTypeFlags ) == 0 )
                {
                    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "WPS encryption type not supported\r\n");
                    return CY_RSLT_WPS_ERROR_ENCRYPTION_TYPE_ERROR;
                }
                break;

            case WPS_ID_MAC_ADDR:
                if (workspace->agent_type == CY_WPS_REGISTRAR_AGENT)
                {
                    parsed_tlvs |= CY_WPS_TLV_MAC_ADDR;
                    workspace->available_crypto_material |= CY_WPS_CRYPTO_MATERIAL_ENROLLEE_MAC_ADDRESS;
                    memcpy(&workspace->enrollee_data->mac_address, tlv->data, sizeof(whd_mac_t));
                }
                break;

            case WPS_ID_UUID_R:
                parsed_tlvs |= CY_WPS_TLV_UUID_R;
                break;

            case WPS_ID_PUBLIC_KEY:
                parsed_tlvs |= CY_WPS_TLV_PUBLIC_KEY;
                workspace->available_crypto_material |= (workspace->agent_type == CY_WPS_ENROLLEE_AGENT) ? CY_WPS_CRYPTO_MATERIAL_ENROLLEE_PUBLIC_KEY : CY_WPS_CRYPTO_MATERIAL_REGISTRAR_PUBLIC_KEY;
                memcpy( &workspace->their_data.public_key, tlv->data, sizeof(cy_public_key_t) );
                break;

            case WPS_ID_MSG_TYPE:
                parsed_tlvs |= CY_WPS_TLV_MSG_TYPE;
                if (*(tlv->data) == WPS_MESSAGE_TYPE_M1)
                {
                    // Catchall for Enrollees that don't include the WPS element in their Probe Request, add their MAC address to the overlap array
                    if ( ( workspace->wps_mode == CY_WPS_PBC_MODE) && ( workspace->is_p2p_registrar == 0 ) && ( workspace->is_p2p_enrollee == 0 ) )
                    {
                        cy_wps_update_pbc_overlap_array( workspace, &workspace->their_data.mac_address );
                    }
                }
                break;

            case WPS_ID_X509_CERT:
                /* XXX: Add X509 certificate support */
                break;

            case WPS_ID_VENDOR_EXT:
                if ( memcmp( tlv->data, WFA_VENDOR_EXT_ID, 3 ) == 0 )
                {
                    tlv8_uint8_t* tlv8 = (tlv8_uint8_t*) tlv_find_tlv8( &tlv->data[3], (uint32_t)( aligned_tlv->length - 3 ), WPS_WFA_SUBID_VERSION2 );
                    if ((tlv8 != NULL) && (workspace->their_data.supported_version == 0 ))
                    {
                        workspace->their_data.supported_version = tlv8->data;
                    }
                }
                break;
        }
    }

    if ( parsed_tlvs != tlv_mask )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Mismatched TLVs. %lu != %lu\r\n", parsed_tlvs, tlv_mask);
        return CY_RSLT_WPS_ERROR_MESSAGE_TLV_MASK_MISMATCH;
    }

    /* Check if we don't have the auth key, but do have the required inputs */
    if (((workspace->available_crypto_material & CY_WPS_CRYPTO_MATERIAL_AUTH_KEY) == 0) &&
        (workspace->available_crypto_material & KDK_REQUIRED_CRYPTO_MATERIAL) == KDK_REQUIRED_CRYPTO_MATERIAL)
    {
        cy_wps_calculate_kdk(workspace);
        cy_wps_calculate_psk(workspace);

        /* Should now be able to calculate my hashes as well */
        cy_wps_calculate_hash(workspace, &workspace->my_data, &workspace->my_data.secret_hash[0], 0);
        cy_wps_calculate_hash(workspace, &workspace->my_data, &workspace->my_data.secret_hash[1], 1);

        workspace->available_crypto_material |= (workspace->agent_type == CY_WPS_ENROLLEE_AGENT) ?
                                                CY_WPS_CRYPTO_MATERIAL_ENROLLEE_HASH1 | CY_WPS_CRYPTO_MATERIAL_ENROLLEE_HASH2 :
                                                CY_WPS_CRYPTO_MATERIAL_REGISTRAR_HASH1 | CY_WPS_CRYPTO_MATERIAL_REGISTRAR_HASH2;
        /* Prepare the hmac for use */
    cy_sha2_hmac_starts( &workspace->hmac, (unsigned char*) &workspace->auth_key, SIZE_256_BITS, WPS_HASH_ALGO );

