hydevcode/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_WIFI/packages/wifi-host-driver-latest/wifi-connection-manager/source/COMPONENT_WPS/cy_wps_common.c
    /* Check if we have a fragment */
    if ( workspace->processing_fragmented_packet == TRUE )
    {
        packet_data          = cy_get_wps_packet_data( packet );

        /* Append to end of fragment */
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Append Fragment. Data Len = [%d], sizeof(eapol_pkt) = [%d]\r\n", data_length, sizeof(cy_eapol_packet_header_t));
        cy_wps_append_fragment( workspace, packet_data, data_length );

        /* Check if there is are more fragments to come */
        if ( packet->eap_expanded.flags & WPS_MORE_FRAGMENTS_MASK )
        {
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Received another fragment (%d bytes)\r\n", data_length - sizeof(cy_eapol_packet_header_t) );
            goto send_frag_ack;
        }
        else
        {
            uint8_t temp_id = packet->eap.id;
            /* Start processing the message */
            cy_wps_retrieve_unfragmented_packet( workspace, (void**) &packet_data, &calculated_packet_length );
            packet = (cy_wps_msg_packet_t*) packet_data;
            packet->eap.id = temp_id;
            workspace->processing_fragmented_packet = FALSE;
        }
    }
    /* Else check if this is the first fragment */
    else if ( packet->eap_expanded.flags & WPS_MORE_FRAGMENTS_MASK )
    {
        workspace->processing_fragmented_packet = TRUE;
        if ( packet->eap_expanded.flags & WPS_LENGTH_FIELD_MASK )
        {
            uint16_t* length_field = (uint16_t*) packet->data;
            cy_wps_init_unfragmented_packet( workspace, cy_hton16( *length_field ) );
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%d bytes expected\r\n", cy_hton16( *length_field ));
        }
        else
        {
            cy_wps_init_unfragmented_packet( workspace, 0 );
            cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Total length unknown\r\n");
        }
        cy_wps_append_fragment( workspace, packet_data, calculated_packet_length );

        goto send_frag_ack;
    }

    *data      = packet_data;
    *data_size = calculated_packet_length;
    return CY_RSLT_SUCCESS;

send_frag_ack:
    /* Send back a frag ack */
    workspace->last_received_id = packet->eap.id;
    cy_host_stop_timer( workspace->wps_host_workspace );
    cy_host_start_timer( workspace->wps_host_workspace , WPS_EAPOL_PACKET_TIMEOUT );
    cy_wps_send_frag_ack( workspace );
    return CY_RSLT_WPS_IN_PROGRESS;
}

static uint32_t cy_wps_send_frag_ack( cy_wps_agent_t* workspace )
{
    cy_packet_t packet;
    cy_wps_msg_packet_header_t* header;
    uint16_t aligned_length;
    uint32_t aligned_vendor_type;

    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Sending frag ACK\r\n");

    /* Create the packet and write the EAP header */
    whd_host_buffer_get( workspace->interface->whd_driver, &packet, WHD_NETWORK_TX, 1024 + WHD_LINK_HEADER, true );
    whd_buffer_add_remove_at_front( workspace->interface->whd_driver, &packet, WHD_LINK_HEADER );

    header = (cy_wps_msg_packet_header_t*) whd_buffer_get_current_piece_data_pointer( workspace->interface->whd_driver, packet );

    if ( workspace->agent_type == CY_WPS_REGISTRAR_AGENT )
    {
        header->eap.code   = CY_EAP_CODE_REQUEST;
    }
    else
    {
        header->eap.code   = CY_EAP_CODE_RESPONSE;
    }
    header->eap.id     = workspace->last_received_id;
    CY_WPS_HOST_WRITE_16_BE(&aligned_length, (sizeof(cy_eap_header_t) + sizeof(cy_eap_expanded_header_t)));
    header->eap.length = aligned_length;
    header->eap.type   = CY_EAP_TYPE_WPS;

    header->eap_expanded.flags       = 0;
    header->eap_expanded.op_code     = 6;
    CY_WPS_HOST_WRITE_32_BE(&aligned_vendor_type, 1);
    header->eap_expanded.vendor_type = aligned_vendor_type;
    memcpy( header->eap_expanded.vendor_id, WFA_VENDOR_EXT_ID, 3 );

    cy_wps_send_eapol_packet( packet, workspace, CY_EAP_PACKET, &workspace->their_data.mac_address, sizeof(cy_eap_header_t) + sizeof(cy_eap_expanded_header_t) );
    return CY_RSLT_SUCCESS;
}

static uint8_t* cy_get_wps_packet_data(cy_wps_msg_packet_t* packet)
{
    /* Check if the packet contains the length field */
    if ((packet->eap_expanded.flags & WPS_LENGTH_FIELD_MASK) != 0)
    {
        return (packet->data + sizeof(uint16_t));
    }
    else
    {
        return packet->data;
    }
}

cy_rslt_t cy_wps_send_basic_packet( cy_wps_agent_t* workspace, uint8_t type, uint16_t optional_config_error )
{
    uint8_t               version;
    cy_packet_t           packet;
    cy_wps_msg_packet_t*  packet_header;
    uint8_t*              iter;
    uint16_t              eap_length;
    uint16_t              aligned_length;
    uint32_t              aligned_vendor_type;

    /* Create the packet */
    whd_host_buffer_get( workspace->interface->whd_driver, &packet, WHD_NETWORK_TX, 1024 + WHD_LINK_HEADER, true );
    whd_buffer_add_remove_at_front( workspace->interface->whd_driver, &packet, WHD_LINK_HEADER );

    packet_header = (cy_wps_msg_packet_t*) whd_buffer_get_current_piece_data_pointer( workspace->interface->whd_driver, packet );
    iter = packet_header->data;

    switch ( type )
    {
        case WPS_PRIVATE_ID_FRAG_ACK:
            packet_header->eap_expanded.op_code = 6; /* WSC Frag ACK */
            break;
        case WPS_ID_MESSAGE_ACK:
            packet_header->eap_expanded.op_code = 2; /* WSC ACK */
            break;
        case WPS_ID_MESSAGE_DONE:
            packet_header->eap_expanded.op_code = 5; /* WSC Done */
            break;
        case WPS_ID_MESSAGE_NACK:
            packet_header->eap_expanded.op_code = 3; /* WSC NACK */
            break;
        default:
            packet_header->eap_expanded.op_code = 4; /* WSC Message */
            break;
    }

    memcpy( packet_header->eap_expanded.vendor_id, WFA_VENDOR_EXT_ID, 3 );
    CY_WPS_HOST_WRITE_32_BE(&aligned_vendor_type, 1);
    packet_header->eap_expanded.vendor_type = aligned_vendor_type;
    /* Version */
    version = WPS_VERSION;
    iter = tlv_write_value( iter, WPS_ID_VERSION, WPS_ID_VERSION_S, &version, TLV_UINT8 );

    /* Message type */
    iter = tlv_write_value( iter, WPS_ID_MSG_TYPE, WPS_ID_MSG_TYPE_S, &type, TLV_UINT8 );

    /* Enrollee and Registrar nonces */
    iter = tlv_write_value( iter, WPS_ID_ENROLLEE_NONCE,  sizeof(cy_wps_nonce_t), &workspace->enrollee_data->nonce,  TLV_UINT8_PTR );
    iter = tlv_write_value( iter, WPS_ID_REGISTRAR_NONCE, sizeof(cy_wps_nonce_t), &workspace->registrar_data->nonce, TLV_UINT8_PTR );

    if ( type == WPS_ID_MESSAGE_NACK )
    {
        iter = tlv_write_value( iter, WPS_ID_CONFIG_ERROR, WPS_ID_CONFIG_ERROR_S, &optional_config_error, TLV_UINT16 );
    }

    /* WSC 2.0 vendor extension */
    if ( workspace->my_data.supported_version >= WPS_VERSION2 )
    {
        iter = cy_wps_write_vendor_extension( iter, workspace );
    }

    eap_length = (uint16_t)( (uint16_t)(iter - packet_header->data) + sizeof(cy_eap_header_t) + sizeof(cy_eap_expanded_header_t) );
    /* write the EAP header */
    packet_header->eap.code           = (workspace->agent_type == CY_WPS_REGISTRAR_AGENT || workspace->in_reverse_registrar_mode == 1) ? CY_EAP_CODE_REQUEST : CY_EAP_CODE_RESPONSE;;
    packet_header->eap.id             = workspace->last_received_id;
    CY_WPS_HOST_WRITE_16_BE(&aligned_length, eap_length );
    packet_header->eap.length = aligned_length;
    packet_header->eap.type           = CY_EAP_TYPE_WPS;
    packet_header->eap_expanded.flags = 0;

    cy_wps_send_eapol_packet( packet, workspace, CY_EAP_PACKET, &workspace->their_data.mac_address, eap_length );

    return CY_RSLT_SUCCESS;
}

static uint8_t* cy_wps_write_vendor_extension( uint8_t* iter, cy_wps_agent_t* workspace )
{
    template_vendor_extension_t* vendor_ext = (template_vendor_extension_t*) iter;

    vendor_ext->header.type     = cy_hton16(WPS_ID_VENDOR_EXT);
    vendor_ext->header.length   = cy_hton16(6);
    memcpy( vendor_ext->vendor_extension_id, WFA_VENDOR_EXT_ID, 3 );

    vendor_ext->version2.type   = WPS_WFA_SUBID_VERSION2;
    vendor_ext->version2.length = 1;
    vendor_ext->version2.data   = workspace->my_data.supported_version;

    return iter + sizeof(template_vendor_extension_t);
}

static cy_rslt_t cy_wps_validate_secret_nonce(cy_wps_agent_t* workspace, cy_wps_agent_data_t* agent_data, uint8_t* data, uint8_t which_nonce)
{
    cy_wps_hash_t temp_hash;
    /* false positive: 238404 Out-of-bounds access
     * data pointer is pointing to tlv->data[1]. coverity is assuming it is only 1 byte array. but this is variable
     * length array and memory for it is already allocated.
     */
    memcpy( &agent_data->secret_nonce[which_nonce], data, sizeof(cy_wps_nonce_t) );
    cy_wps_calculate_hash( workspace, agent_data, &temp_hash, which_nonce );
    if ( memcmp( &temp_hash, &agent_data->secret_hash[which_nonce], sizeof(cy_wps_hash_t) ) != 0 )
    {
        cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "WPS: Secret nonce validation failed\r\n");
        return CY_RSLT_WPS_ERROR_SECRET_NONCE_MISMATCH;
    }
    return CY_RSLT_SUCCESS;
}

static cy_rslt_t cy_wps_send_wsc_nack(cy_wps_agent_t* workspace, uint16_t config_error)
{
    return cy_wps_send_basic_packet( workspace, WPS_ID_MESSAGE_NACK, config_error );
}

void cy_wps_send_eapol_packet(cy_packet_t packet, cy_wps_agent_t* workspace, cy_eapol_packet_type_t type, whd_mac_t* their_mac_address, uint16_t content_size )
{
    cy_host_workspace_t* wps_host_workspace = (cy_host_workspace_t*) workspace->wps_host_workspace;
    cy_eapol_packet_t* header = (cy_eapol_packet_t*) whd_buffer_get_current_piece_data_pointer( workspace->interface->whd_driver, packet );
    memcpy( header->ethernet.ether_dhost, their_mac_address, sizeof(whd_mac_t) );
    memcpy( header->ethernet.ether_shost, &workspace->my_data.mac_address, sizeof(whd_mac_t) );
    header->ethernet.ether_type = cy_hton16( ETHER_TYPE_802_1X );
    header->eapol.version = 1;
    header->eapol.type    = type;
    header->eapol.length  = cy_hton16( content_size );
    whd_buffer_set_size( wps_host_workspace->interface->whd_driver, packet, (uint16_t)( content_size + sizeof(cy_eapol_packet_header_t) ));
    whd_network_send_ethernet_data( wps_host_workspace->interface, packet );
}

static cy_rslt_t cy_wps_send_done( cy_wps_agent_t* workspace )
{
    cy_wcm_log_msg(CYLF_MIDDLEWARE, CY_LOG_INFO, "Sending WSC Done\r\n");
    return cy_wps_send_basic_packet( workspace, WPS_ID_MESSAGE_DONE, 0 );
}
